mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c1xc/common/s6e1c1xc.h
typedef struct stc_gpio_epfr31_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :24;
            __IO  uint32_t  SI2CSCL6B            :2;
            __IO  uint32_t  SI2CSDA6B            :2;
            __IO  uint32_t  RESERVED2            :4;
        };
        struct {
            __IO  uint32_t  RESERVED1            :24;
            __IO  uint32_t  SI2CSCL6B0           :1;
            __IO  uint32_t  SI2CSCL6B1           :1;
            __IO  uint32_t  SI2CSDA6B0           :1;
            __IO  uint32_t  SI2CSDA6B1           :1;
            __IO  uint32_t  RESERVED3            :4;
        };
    };
} stc_gpio_epfr31_field_t;

typedef struct stc_gpio_epfr33_field
{
    union {
        struct {
            __IO  uint32_t  CIN0S                :2;
            __IO  uint32_t  DATA0B               :2;
            __IO  uint32_t  RST0E                :2;
            __IO  uint32_t  VPEN0E               :2;
            __IO  uint32_t  VCC0E                :2;
            __IO  uint32_t  CLK0E                :2;
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  CIN1S                :2;
            __IO  uint32_t  DATA1B               :2;
            __IO  uint32_t  RST1E                :2;
            __IO  uint32_t  VPEN1E               :2;
            __IO  uint32_t  VCC1E                :2;
            __IO  uint32_t  CLK1E                :2;
            __IO  uint32_t  RESERVED2            :4;
        };
        struct {
            __IO  uint32_t  CIN0S0               :1;
            __IO  uint32_t  CIN0S1               :1;
            __IO  uint32_t  DATA0B0              :1;
            __IO  uint32_t  DATA0B1              :1;
            __IO  uint32_t  RST0E0               :1;
            __IO  uint32_t  RST0E1               :1;
            __IO  uint32_t  VPEN0E0              :1;
            __IO  uint32_t  VPEN0E1              :1;
            __IO  uint32_t  VCC0E0               :1;
            __IO  uint32_t  VCC0E1               :1;
            __IO  uint32_t  CLK0E0               :1;
            __IO  uint32_t  CLK0E1               :1;
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  CIN1S0               :1;
            __IO  uint32_t  CIN1S1               :1;
            __IO  uint32_t  DATA1B0              :1;
            __IO  uint32_t  DATA1B1              :1;
            __IO  uint32_t  RST1E0               :1;
            __IO  uint32_t  RST1E1               :1;
            __IO  uint32_t  VPEN1E0              :1;
            __IO  uint32_t  VPEN1E1              :1;
            __IO  uint32_t  VCC1E0               :1;
            __IO  uint32_t  VCC1E1               :1;
            __IO  uint32_t  CLK1E0               :1;
            __IO  uint32_t  CLK1E1               :1;
            __IO  uint32_t  RESERVED3            :4;
        };
    };
} stc_gpio_epfr33_field_t;

typedef struct stc_gpio_epfr34_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  RTS1E                :2;
            __IO  uint32_t  CTS1S                :2;
            __IO  uint32_t  RESERVED2            :24;
        };
        struct {
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  RTS1E0               :1;
            __IO  uint32_t  RTS1E1               :1;
            __IO  uint32_t  CTS1S0               :1;
            __IO  uint32_t  CTS1S1               :1;
            __IO  uint32_t  RESERVED3            :24;
        };
    };
} stc_gpio_epfr34_field_t;

typedef struct stc_gpio_epfr37_field
{
    union {
        struct {
            __IO  uint32_t  MCK4S                :2;
            __IO  uint32_t  MCK4E                :2;
            __IO  uint32_t  SCK4B                :2;
            __IO  uint32_t  WS4B                 :2;
            __IO  uint32_t  SDI4S                :2;
            __IO  uint32_t  SDO4E                :2;
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  MCK5S                :2;
            __IO  uint32_t  MCK5E                :2;
            __IO  uint32_t  SCK5B                :2;
            __IO  uint32_t  WS5B                 :2;
            __IO  uint32_t  SDI5S                :2;
            __IO  uint32_t  SDO5E                :2;
            __IO  uint32_t  RESERVED2            :4;
        };
        struct {
            __IO  uint32_t  MCK4S0               :1;
            __IO  uint32_t  MCK4S1               :1;
            __IO  uint32_t  MCK4E0               :1;
            __IO  uint32_t  MCK4E1               :1;
            __IO  uint32_t  SCK4B0               :1;
            __IO  uint32_t  SCK4B1               :1;
            __IO  uint32_t  WS4B0                :1;
            __IO  uint32_t  WS4B1                :1;
            __IO  uint32_t  SDI4S0               :1;
            __IO  uint32_t  SDI4S1               :1;
            __IO  uint32_t  SDO4E0               :1;
            __IO  uint32_t  SDO4E1               :1;
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  MCK5S0               :1;
            __IO  uint32_t  MCK5S1               :1;
            __IO  uint32_t  MCK5E0               :1;
            __IO  uint32_t  MCK5E1               :1;
            __IO  uint32_t  SCK5B0               :1;
            __IO  uint32_t  SCK5B1               :1;
            __IO  uint32_t  WS5B0                :1;
            __IO  uint32_t  WS5B1                :1;
            __IO  uint32_t  SDI5S0               :1;
            __IO  uint32_t  SDI5S1               :1;
            __IO  uint32_t  SDO5E0               :1;
            __IO  uint32_t  SDO5E1               :1;
            __IO  uint32_t  RESERVED3            :4;
        };
    };
} stc_gpio_epfr37_field_t;

typedef struct stc_gpio_epfr38_field
{
    union {
        struct {
            __IO  uint32_t  MCK6S                :2;
            __IO  uint32_t  MCK6E                :2;
            __IO  uint32_t  SCK6B                :2;
            __IO  uint32_t  WS6B                 :2;
            __IO  uint32_t  SDI6S                :2;
            __IO  uint32_t  SDO6E                :2;
            __IO  uint32_t  RESERVED0            :20;
        };
        struct {
            __IO  uint32_t  MCK6S0               :1;
            __IO  uint32_t  MCK6S1               :1;
            __IO  uint32_t  MCK6E0               :1;
            __IO  uint32_t  MCK6E1               :1;
            __IO  uint32_t  SCK6B0               :1;
            __IO  uint32_t  SCK6B1               :1;
            __IO  uint32_t  WS6B0                :1;
            __IO  uint32_t  WS6B1                :1;
            __IO  uint32_t  SDI6S0               :1;
            __IO  uint32_t  SDI6S1               :1;
            __IO  uint32_t  SDO6E0               :1;
            __IO  uint32_t  SDO6E1               :1;
            __IO  uint32_t  RESERVED1            :20;
        };
    };
} stc_gpio_epfr38_field_t;

typedef struct stc_gpio_pzr0_field
{
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED1                :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED2                :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  RESERVED3                :9;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED4                :16;
} stc_gpio_pzr0_field_t;

typedef struct stc_gpio_pzr1_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  RESERVED0                :4;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  RESERVED1                :20;
} stc_gpio_pzr1_field_t;

typedef struct stc_gpio_pzr2_field
{
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_gpio_pzr2_field_t;

typedef struct stc_gpio_pzr3_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  RESERVED0                :5;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  RESERVED1                :19;
} stc_gpio_pzr3_field_t;

