mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c1xc/common/s6e1c1xc.h
typedef struct stc_gpio_pzr4_field
{
        __IO  uint32_t  RESERVED0                :6;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  RESERVED1                :4;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  RESERVED2                :17;
} stc_gpio_pzr4_field_t;

typedef struct stc_gpio_pzr5_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED0                :28;
} stc_gpio_pzr5_field_t;

typedef struct stc_gpio_pzr6_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gpio_pzr6_field_t;

typedef struct stc_gpio_pzr8_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gpio_pzr8_field_t;

typedef struct stc_gpio_pzre_field
{
        __IO  uint32_t  RESERVED0                :2;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_gpio_pzre_field_t;

typedef struct stc_gpio_lvdie_field
{
        __IO  uint32_t  LVDIE                    :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_gpio_lvdie_field_t;

typedef struct stc_gpio_fpoer0_field
{
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED1                :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED2                :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  RESERVED3                :9;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED4                :16;
} stc_gpio_fpoer0_field_t;

typedef struct stc_gpio_fpoer1_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  RESERVED0                :4;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  RESERVED1                :20;
} stc_gpio_fpoer1_field_t;

typedef struct stc_gpio_fpoer2_field
{
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_gpio_fpoer2_field_t;

typedef struct stc_gpio_fpoer3_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  RESERVED0                :5;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  RESERVED1                :19;
} stc_gpio_fpoer3_field_t;

typedef struct stc_gpio_fpoer4_field
{
        __IO  uint32_t  RESERVED0                :6;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  RESERVED1                :4;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  RESERVED2                :17;
} stc_gpio_fpoer4_field_t;

typedef struct stc_gpio_fpoer5_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED0                :28;
} stc_gpio_fpoer5_field_t;

typedef struct stc_gpio_fpoer6_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gpio_fpoer6_field_t;

typedef struct stc_gpio_fpoer8_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gpio_fpoer8_field_t;

typedef struct stc_gpio_fpoere_field
{
        __IO  uint32_t  RESERVED0                :2;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_gpio_fpoere_field_t;

/*******************************************************************************
* HDMICEC_MODULE
*******************************************************************************/
typedef struct stc_hdmicec_txctrl_field
{
        __IO   uint8_t  TXEN                     :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  START                    :1;
        __IO   uint8_t  EOM                      :1;
        __IO   uint8_t  ITSTEN                   :1;
        __IO   uint8_t  IBREN                    :1;
        __IO   uint8_t  RESERVED1                :2;
} stc_hdmicec_txctrl_field_t;

