mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c1xc/common/s6e1c1xc.h
typedef struct stc_smcif_fifo_level_read_field
{
    union {
        struct {
            __IO  uint16_t  FIFORDLEVEL          :16;
        };
        struct {
            __IO  uint16_t  FIFORDLEVEL0         :1;
            __IO  uint16_t  FIFORDLEVEL1         :1;
            __IO  uint16_t  FIFORDLEVEL2         :1;
            __IO  uint16_t  FIFORDLEVEL3         :1;
            __IO  uint16_t  FIFORDLEVEL4         :1;
            __IO  uint16_t  FIFORDLEVEL5         :1;
            __IO  uint16_t  FIFORDLEVEL6         :1;
            __IO  uint16_t  FIFORDLEVEL7         :1;
            __IO  uint16_t  FIFORDLEVEL8         :1;
            __IO  uint16_t  FIFORDLEVEL9         :1;
            __IO  uint16_t  FIFORDLEVEL10        :1;
            __IO  uint16_t  FIFORDLEVEL11        :1;
            __IO  uint16_t  FIFORDLEVEL12        :1;
            __IO  uint16_t  FIFORDLEVEL13        :1;
            __IO  uint16_t  FIFORDLEVEL14        :1;
            __IO  uint16_t  FIFORDLEVEL15        :1;
        };
    };
} stc_smcif_fifo_level_read_field_t;

typedef struct stc_smcif_fifo_level_write_field
{
    union {
        struct {
            __IO  uint16_t  FIFOWRLEVEL          :16;
        };
        struct {
            __IO  uint16_t  FIFOWRLEVEL0         :1;
            __IO  uint16_t  FIFOWRLEVEL1         :1;
            __IO  uint16_t  FIFOWRLEVEL2         :1;
            __IO  uint16_t  FIFOWRLEVEL3         :1;
            __IO  uint16_t  FIFOWRLEVEL4         :1;
            __IO  uint16_t  FIFOWRLEVEL5         :1;
            __IO  uint16_t  FIFOWRLEVEL6         :1;
            __IO  uint16_t  FIFOWRLEVEL7         :1;
            __IO  uint16_t  FIFOWRLEVEL8         :1;
            __IO  uint16_t  FIFOWRLEVEL9         :1;
            __IO  uint16_t  FIFOWRLEVEL10        :1;
            __IO  uint16_t  FIFOWRLEVEL11        :1;
            __IO  uint16_t  FIFOWRLEVEL12        :1;
            __IO  uint16_t  FIFOWRLEVEL13        :1;
            __IO  uint16_t  FIFOWRLEVEL14        :1;
            __IO  uint16_t  FIFOWRLEVEL15        :1;
        };
    };
} stc_smcif_fifo_level_write_field_t;

typedef struct stc_smcif_fifo_mode_field
{
    union {
        struct {
            __IO  uint16_t  FIFOEN               :1;
            __IO  uint16_t  RDFIFOOVRIRQEN       :1;
            __IO  uint16_t  WRFIFOIRQEN          :1;
            __IO  uint16_t  RDFIFOIRQEN          :1;
            __IO  uint16_t  RESERVED0            :4;
            __IO  uint16_t  WRFIFOLEVEL          :4;
            __IO  uint16_t  RDFIFOLEVEL          :4;
        };
        struct {
            __IO  uint16_t  RESERVED1            :8;
            __IO  uint16_t  WRFIFOLEVEL0         :1;
            __IO  uint16_t  WRFIFOLEVEL1         :1;
            __IO  uint16_t  WRFIFOLEVEL2         :1;
            __IO  uint16_t  WRFIFOLEVEL3         :1;
            __IO  uint16_t  RDFIFOLEVEL0         :1;
            __IO  uint16_t  RDFIFOLEVEL1         :1;
            __IO  uint16_t  RDFIFOLEVEL2         :1;
            __IO  uint16_t  RDFIFOLEVEL3         :1;
        };
    };
} stc_smcif_fifo_mode_field_t;

typedef struct stc_smcif_fifo_clear_msb_write_field
{
        __IO  uint16_t  CLRWRFIFO                :1;
        __IO  uint16_t  RESERVED0                :15;
} stc_smcif_fifo_clear_msb_write_field_t;

typedef struct stc_smcif_fifo_clear_msb_read_field
{
        __IO  uint16_t  CLRRDFIFO                :1;
        __IO  uint16_t  RESERVED0                :15;
} stc_smcif_fifo_clear_msb_read_field_t;

typedef struct stc_smcif_irq_status_field
{
        __IO  uint16_t  RDFIFOOVRIRQ             :1;
        __IO  uint16_t  WRFIFOIRQ                :1;
        __IO  uint16_t  RDFIFOIRQ                :1;
        __IO  uint16_t  IDTEXPIRQ                :1;
        __IO  uint16_t  CARDEVENTIRQ             :1;
        __IO  uint16_t  RXSTBIIRQ                :1;
        __IO  uint16_t  TXEMPIRQ                 :1;
        __IO  uint16_t  RXFULIRQ                 :1;
        __IO  uint16_t  RESERVED0                :8;
} stc_smcif_irq_status_field_t;

/*******************************************************************************
* SWWDT_MODULE
*******************************************************************************/
typedef struct stc_swwdt_wdogcontrol_field
{
    union {
        struct {
            __IO  uint32_t  INTEN                :1;
            __IO  uint32_t  RESEN                :1;
            __IO  uint32_t  TWD                  :2;
            __IO  uint32_t  SPM                  :1;
            __IO  uint32_t  RESERVED1            :27;
        };
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  TWD0                 :1;
            __IO  uint32_t  TWD1                 :1;
            __IO  uint32_t  RESERVED2            :28;
        };
    };
} stc_swwdt_wdogcontrol_field_t;

typedef struct stc_swwdt_wdogris_field
{
        __IO  uint32_t  RIS                      :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_swwdt_wdogris_field_t;

typedef struct stc_swwdt_wdogspmc_field
{
        __IO  uint32_t  TGR                      :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_swwdt_wdogspmc_field_t;

/*******************************************************************************
* UNIQUE_ID_MODULE
*******************************************************************************/
typedef struct stc_unique_id_uidr0_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  UID                  :28;
        };
        struct {
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  UID0                 :1;
            __IO  uint32_t  UID1                 :1;
            __IO  uint32_t  UID2                 :1;
            __IO  uint32_t  UID3                 :1;
            __IO  uint32_t  UID4                 :1;
            __IO  uint32_t  UID5                 :1;
            __IO  uint32_t  UID6                 :1;
            __IO  uint32_t  UID7                 :1;
            __IO  uint32_t  UID8                 :1;
            __IO  uint32_t  UID9                 :1;
            __IO  uint32_t  UID10                :1;
            __IO  uint32_t  UID11                :1;
            __IO  uint32_t  UID12                :1;
            __IO  uint32_t  UID13                :1;
            __IO  uint32_t  UID14                :1;
            __IO  uint32_t  UID15                :1;
            __IO  uint32_t  UID16                :1;
            __IO  uint32_t  UID17                :1;
            __IO  uint32_t  UID18                :1;
            __IO  uint32_t  UID19                :1;
            __IO  uint32_t  UID20                :1;
            __IO  uint32_t  UID21                :1;
            __IO  uint32_t  UID22                :1;
            __IO  uint32_t  UID23                :1;
            __IO  uint32_t  UID24                :1;
            __IO  uint32_t  UID25                :1;
            __IO  uint32_t  UID26                :1;
            __IO  uint32_t  UID27                :1;
        };
    };
} stc_unique_id_uidr0_field_t;

