mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c1xc/common/s6e1c1xc.h
/*******************************************************************************
* MFSI2S Registers MFSI2S0
*   Register Definition
*******************************************************************************/
#define FM_MFSI2S0_CNTLREG                        *((volatile uint16_t*)(0x4003CA00UL))
#define FM0P_MFSI2S0_CNTLREG                      *((volatile uint16_t*)(0x4003CA00UL))
#define FM_MFSI2S0_I2SCLK                         *((volatile uint16_t*)(0x4003CA04UL))
#define FM0P_MFSI2S0_I2SCLK                       *((volatile uint16_t*)(0x4003CA04UL))
#define FM_MFSI2S0_I2SRST                         *((volatile  uint8_t*)(0x4003CA08UL))
#define FM0P_MFSI2S0_I2SRST                       *((volatile  uint8_t*)(0x4003CA08UL))
#define FM_MFSI2S0_I2SST                          *((volatile  uint8_t*)(0x4003CA09UL))
#define FM0P_MFSI2S0_I2SST                        *((volatile  uint8_t*)(0x4003CA09UL))

/*******************************************************************************
* MFSI2S Registers MFSI2S1
*   Register Definition
*******************************************************************************/
#define FM_MFSI2S1_CNTLREG                        *((volatile uint16_t*)(0x4003CA80UL))
#define FM0P_MFSI2S1_CNTLREG                      *((volatile uint16_t*)(0x4003CA80UL))
#define FM_MFSI2S1_I2SCLK                         *((volatile uint16_t*)(0x4003CA84UL))
#define FM0P_MFSI2S1_I2SCLK                       *((volatile uint16_t*)(0x4003CA84UL))
#define FM_MFSI2S1_I2SRST                         *((volatile  uint8_t*)(0x4003CA88UL))
#define FM0P_MFSI2S1_I2SRST                       *((volatile  uint8_t*)(0x4003CA88UL))
#define FM_MFSI2S1_I2SST                          *((volatile  uint8_t*)(0x4003CA89UL))
#define FM0P_MFSI2S1_I2SST                        *((volatile  uint8_t*)(0x4003CA89UL))

/*******************************************************************************
* MTB_DWT Registers MTB_DWT
*   Register Definition
*******************************************************************************/
#define FM_MTB_DWT_CMP_ADDR_START                 *((volatile uint32_t*)(0xF0001000UL))
#define FM0P_MTB_DWT_CMP_ADDR_START               *((volatile uint32_t*)(0xF0001000UL))
#define FM_MTB_DWT_CMP_DATA_START                 *((volatile uint32_t*)(0xF0001004UL))
#define FM0P_MTB_DWT_CMP_DATA_START               *((volatile uint32_t*)(0xF0001004UL))
#define FM_MTB_DWT_CMP_MASK_START                 *((volatile uint32_t*)(0xF0001008UL))
#define FM0P_MTB_DWT_CMP_MASK_START               *((volatile uint32_t*)(0xF0001008UL))
#define FM_MTB_DWT_CMP_ADDR_STOP                  *((volatile uint32_t*)(0xF0001010UL))
#define FM0P_MTB_DWT_CMP_ADDR_STOP                *((volatile uint32_t*)(0xF0001010UL))
#define FM_MTB_DWT_CMP_DATA_STOP                  *((volatile uint32_t*)(0xF0001014UL))
#define FM0P_MTB_DWT_CMP_DATA_STOP                *((volatile uint32_t*)(0xF0001014UL))
#define FM_MTB_DWT_CMP_MASK_STOP                  *((volatile uint32_t*)(0xF0001018UL))
#define FM0P_MTB_DWT_CMP_MASK_STOP                *((volatile uint32_t*)(0xF0001018UL))
#define FM_MTB_DWT_FCT                            *((volatile  uint8_t*)(0xF0001020UL))
#define FM0P_MTB_DWT_FCT                          *((volatile  uint8_t*)(0xF0001020UL))
#define FM_MTB_DWT_PID4                           *((volatile uint32_t*)(0xF0001FD0UL))
#define FM0P_MTB_DWT_PID4                         *((volatile uint32_t*)(0xF0001FD0UL))
#define FM_MTB_DWT_PID5                           *((volatile uint32_t*)(0xF0001FD4UL))
#define FM0P_MTB_DWT_PID5                         *((volatile uint32_t*)(0xF0001FD4UL))
#define FM_MTB_DWT_PID6                           *((volatile uint32_t*)(0xF0001FD8UL))
#define FM0P_MTB_DWT_PID6                         *((volatile uint32_t*)(0xF0001FD8UL))
#define FM_MTB_DWT_PID7                           *((volatile uint32_t*)(0xF0001FDCUL))
#define FM0P_MTB_DWT_PID7                         *((volatile uint32_t*)(0xF0001FDCUL))
#define FM_MTB_DWT_PID0                           *((volatile uint32_t*)(0xF0001FE0UL))
#define FM0P_MTB_DWT_PID0                         *((volatile uint32_t*)(0xF0001FE0UL))
#define FM_MTB_DWT_PID1                           *((volatile uint32_t*)(0xF0001FE4UL))
#define FM0P_MTB_DWT_PID1                         *((volatile uint32_t*)(0xF0001FE4UL))
#define FM_MTB_DWT_PID2                           *((volatile uint32_t*)(0xF0001FE8UL))
#define FM0P_MTB_DWT_PID2                         *((volatile uint32_t*)(0xF0001FE8UL))
#define FM_MTB_DWT_PID3                           *((volatile uint32_t*)(0xF0001FECUL))
#define FM0P_MTB_DWT_PID3                         *((volatile uint32_t*)(0xF0001FECUL))
#define FM_MTB_DWT_CID0                           *((volatile uint32_t*)(0xF0001FF0UL))
#define FM0P_MTB_DWT_CID0                         *((volatile uint32_t*)(0xF0001FF0UL))
#define FM_MTB_DWT_CID1                           *((volatile uint32_t*)(0xF0001FF4UL))
#define FM0P_MTB_DWT_CID1                         *((volatile uint32_t*)(0xF0001FF4UL))
#define FM_MTB_DWT_CID2                           *((volatile uint32_t*)(0xF0001FF8UL))
#define FM0P_MTB_DWT_CID2                         *((volatile uint32_t*)(0xF0001FF8UL))
#define FM_MTB_DWT_CID3                           *((volatile uint32_t*)(0xF0001FFCUL))
#define FM0P_MTB_DWT_CID3                         *((volatile uint32_t*)(0xF0001FFCUL))

/*******************************************************************************
* RTC Registers RTC
*   Register Definition
*******************************************************************************/
#define FM_RTC_WTCR1                              *((volatile uint32_t*)(0x4003B000UL))
#define FM0P_RTC_WTCR1                            *((volatile uint32_t*)(0x4003B000UL))
#define FM_RTC_WTCR2                              *((volatile uint32_t*)(0x4003B004UL))
#define FM0P_RTC_WTCR2                            *((volatile uint32_t*)(0x4003B004UL))
#define FM_RTC_WTBR                               *((volatile uint32_t*)(0x4003B008UL))
#define FM0P_RTC_WTBR                             *((volatile uint32_t*)(0x4003B008UL))
#define FM_RTC_WTSR                               *((volatile  uint8_t*)(0x4003B00CUL))
#define FM0P_RTC_WTSR                             *((volatile  uint8_t*)(0x4003B00CUL))
#define FM_RTC_WTMIR                              *((volatile  uint8_t*)(0x4003B00DUL))
#define FM0P_RTC_WTMIR                            *((volatile  uint8_t*)(0x4003B00DUL))
#define FM_RTC_WTHR                               *((volatile  uint8_t*)(0x4003B00EUL))
#define FM0P_RTC_WTHR                             *((volatile  uint8_t*)(0x4003B00EUL))
#define FM_RTC_WTDR                               *((volatile  uint8_t*)(0x4003B00FUL))
#define FM0P_RTC_WTDR                             *((volatile  uint8_t*)(0x4003B00FUL))
#define FM_RTC_WTDW                               *((volatile  uint8_t*)(0x4003B010UL))
#define FM0P_RTC_WTDW                             *((volatile  uint8_t*)(0x4003B010UL))
#define FM_RTC_WTMOR                              *((volatile  uint8_t*)(0x4003B011UL))
#define FM0P_RTC_WTMOR                            *((volatile  uint8_t*)(0x4003B011UL))
#define FM_RTC_WTYR                               *((volatile  uint8_t*)(0x4003B012UL))
#define FM0P_RTC_WTYR                             *((volatile  uint8_t*)(0x4003B012UL))
#define FM_RTC_ALMIR                              *((volatile  uint8_t*)(0x4003B015UL))
#define FM0P_RTC_ALMIR                            *((volatile  uint8_t*)(0x4003B015UL))
#define FM_RTC_ALHR                               *((volatile  uint8_t*)(0x4003B016UL))
#define FM0P_RTC_ALHR                             *((volatile  uint8_t*)(0x4003B016UL))
#define FM_RTC_ALDR                               *((volatile  uint8_t*)(0x4003B017UL))
#define FM0P_RTC_ALDR                             *((volatile  uint8_t*)(0x4003B017UL))
#define FM_RTC_ALMOR                              *((volatile  uint8_t*)(0x4003B019UL))
#define FM0P_RTC_ALMOR                            *((volatile  uint8_t*)(0x4003B019UL))
#define FM_RTC_ALYR                               *((volatile  uint8_t*)(0x4003B01AUL))
#define FM0P_RTC_ALYR                             *((volatile  uint8_t*)(0x4003B01AUL))
#define FM_RTC_WTTR                               *((volatile uint32_t*)(0x4003B01CUL))
#define FM0P_RTC_WTTR                             *((volatile uint32_t*)(0x4003B01CUL))
#define FM_RTC_WTCLKS                             *((volatile  uint8_t*)(0x4003B020UL))
#define FM0P_RTC_WTCLKS                           *((volatile  uint8_t*)(0x4003B020UL))
#define FM_RTC_WTCLKM                             *((volatile  uint8_t*)(0x4003B021UL))
#define FM0P_RTC_WTCLKM                           *((volatile  uint8_t*)(0x4003B021UL))
#define FM_RTC_WTCAL                              *((volatile uint16_t*)(0x4003B024UL))
#define FM0P_RTC_WTCAL                            *((volatile uint16_t*)(0x4003B024UL))
#define FM_RTC_WTCALEN                            *((volatile  uint8_t*)(0x4003B026UL))
#define FM0P_RTC_WTCALEN                          *((volatile  uint8_t*)(0x4003B026UL))
#define FM_RTC_WTDIV                              *((volatile  uint8_t*)(0x4003B028UL))
#define FM0P_RTC_WTDIV                            *((volatile  uint8_t*)(0x4003B028UL))
#define FM_RTC_WTDIVEN                            *((volatile  uint8_t*)(0x4003B029UL))
#define FM0P_RTC_WTDIVEN                          *((volatile  uint8_t*)(0x4003B029UL))
#define FM_RTC_WTCALPRD                           *((volatile  uint8_t*)(0x4003B02CUL))
#define FM0P_RTC_WTCALPRD                         *((volatile  uint8_t*)(0x4003B02CUL))
#define FM_RTC_WTCOSEL                            *((volatile  uint8_t*)(0x4003B030UL))
#define FM0P_RTC_WTCOSEL                          *((volatile  uint8_t*)(0x4003B030UL))

