mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c1xc/common/s6e1c1xc.h
#define bFM_GPIO_PZR6_P0                          *((volatile  uint8_t *)(0x4266E300UL))
#define bFM0P_GPIO_PZR6_P0                        *((volatile  uint8_t *)(0x4266E300UL))
#define bFM_GPIO_PZR6_P1                          *((volatile  uint8_t *)(0x4266E304UL))
#define bFM0P_GPIO_PZR6_P1                        *((volatile  uint8_t *)(0x4266E304UL))

#define bFM_GPIO_PZR8_P0                          *((volatile  uint8_t *)(0x4266E400UL))
#define bFM0P_GPIO_PZR8_P0                        *((volatile  uint8_t *)(0x4266E400UL))
#define bFM_GPIO_PZR8_P1                          *((volatile  uint8_t *)(0x4266E404UL))
#define bFM0P_GPIO_PZR8_P1                        *((volatile  uint8_t *)(0x4266E404UL))

#define bFM_GPIO_PZRE_P2                          *((volatile  uint8_t *)(0x4266E708UL))
#define bFM0P_GPIO_PZRE_P2                        *((volatile  uint8_t *)(0x4266E708UL))
#define bFM_GPIO_PZRE_P3                          *((volatile  uint8_t *)(0x4266E70CUL))
#define bFM0P_GPIO_PZRE_P3                        *((volatile  uint8_t *)(0x4266E70CUL))

#define bFM_GPIO_SPSR_USB0C                       *((volatile  uint8_t *)(0x4266B010UL))
#define bFM0P_GPIO_SPSR_USB0C                     *((volatile  uint8_t *)(0x4266B010UL))


/*******************************************************************************
* HDMICEC Registers HDMICEC0
*   Bitband Section
*******************************************************************************/
#define bFM_HDMICEC0_RCCKD_CKSEL                  *((volatile  uint16_t*)(0x42680B30UL))
#define bFM0P_HDMICEC0_RCCKD_CKSEL                *((volatile  uint16_t*)(0x42680B30UL))

#define bFM_HDMICEC0_RCCR_EN                      *((volatile  uint8_t *)(0x42680820UL))
#define bFM0P_HDMICEC0_RCCR_EN                    *((volatile  uint8_t *)(0x42680820UL))
#define bFM_HDMICEC0_RCCR_ADRCE                   *((volatile  uint8_t *)(0x4268082CUL))
#define bFM0P_HDMICEC0_RCCR_ADRCE                 *((volatile  uint8_t *)(0x4268082CUL))
#define bFM_HDMICEC0_RCCR_THSEL                   *((volatile  uint8_t *)(0x4268083CUL))
#define bFM0P_HDMICEC0_RCCR_THSEL                 *((volatile  uint8_t *)(0x4268083CUL))

#define bFM_HDMICEC0_RCLE_LES                     *((volatile  uint8_t *)(0x42680C20UL))
#define bFM0P_HDMICEC0_RCLE_LES                   *((volatile  uint8_t *)(0x42680C20UL))
#define bFM_HDMICEC0_RCLE_LEL                     *((volatile  uint8_t *)(0x42680C24UL))
#define bFM0P_HDMICEC0_RCLE_LEL                   *((volatile  uint8_t *)(0x42680C24UL))
#define bFM_HDMICEC0_RCLE_EPE                     *((volatile  uint8_t *)(0x42680C2CUL))
#define bFM0P_HDMICEC0_RCLE_EPE                   *((volatile  uint8_t *)(0x42680C2CUL))
#define bFM_HDMICEC0_RCLE_LESE                    *((volatile  uint8_t *)(0x42680C30UL))
#define bFM0P_HDMICEC0_RCLE_LESE                  *((volatile  uint8_t *)(0x42680C30UL))
#define bFM_HDMICEC0_RCLE_LELE                    *((volatile  uint8_t *)(0x42680C34UL))
#define bFM0P_HDMICEC0_RCLE_LELE                  *((volatile  uint8_t *)(0x42680C34UL))
#define bFM_HDMICEC0_RCLE_LESIE                   *((volatile  uint8_t *)(0x42680C38UL))
#define bFM0P_HDMICEC0_RCLE_LESIE                 *((volatile  uint8_t *)(0x42680C38UL))
#define bFM_HDMICEC0_RCLE_LELIE                   *((volatile  uint8_t *)(0x42680C3CUL))
#define bFM0P_HDMICEC0_RCLE_LELIE                 *((volatile  uint8_t *)(0x42680C3CUL))

#define bFM_HDMICEC0_RCRC_RC                      *((volatile  uint8_t *)(0x42680BA0UL))
#define bFM0P_HDMICEC0_RCRC_RC                    *((volatile  uint8_t *)(0x42680BA0UL))
#define bFM_HDMICEC0_RCRC_RCIE                    *((volatile  uint8_t *)(0x42680BB0UL))
#define bFM0P_HDMICEC0_RCRC_RCIE                  *((volatile  uint8_t *)(0x42680BB0UL))

#define bFM_HDMICEC0_RCST_OVF                     *((volatile  uint8_t *)(0x42680800UL))
#define bFM0P_HDMICEC0_RCST_OVF                   *((volatile  uint8_t *)(0x42680800UL))
#define bFM_HDMICEC0_RCST_EOM                     *((volatile  uint8_t *)(0x42680804UL))
#define bFM0P_HDMICEC0_RCST_EOM                   *((volatile  uint8_t *)(0x42680804UL))
#define bFM_HDMICEC0_RCST_ACK                     *((volatile  uint8_t *)(0x42680808UL))
#define bFM0P_HDMICEC0_RCST_ACK                   *((volatile  uint8_t *)(0x42680808UL))
#define bFM_HDMICEC0_RCST_ST                      *((volatile  uint8_t *)(0x4268080CUL))
#define bFM0P_HDMICEC0_RCST_ST                    *((volatile  uint8_t *)(0x4268080CUL))
#define bFM_HDMICEC0_RCST_OVFSEL                  *((volatile  uint8_t *)(0x42680810UL))
#define bFM0P_HDMICEC0_RCST_OVFSEL                *((volatile  uint8_t *)(0x42680810UL))
#define bFM_HDMICEC0_RCST_OVFIE                   *((volatile  uint8_t *)(0x42680814UL))
#define bFM0P_HDMICEC0_RCST_OVFIE                 *((volatile  uint8_t *)(0x42680814UL))
#define bFM_HDMICEC0_RCST_ACKIE                   *((volatile  uint8_t *)(0x42680818UL))
#define bFM0P_HDMICEC0_RCST_ACKIE                 *((volatile  uint8_t *)(0x42680818UL))
#define bFM_HDMICEC0_RCST_STIE                    *((volatile  uint8_t *)(0x4268081CUL))
#define bFM0P_HDMICEC0_RCST_STIE                  *((volatile  uint8_t *)(0x4268081CUL))

#define bFM_HDMICEC0_TXCTRL_TXEN                  *((volatile  uint8_t *)(0x42680000UL))
#define bFM0P_HDMICEC0_TXCTRL_TXEN                *((volatile  uint8_t *)(0x42680000UL))
#define bFM_HDMICEC0_TXCTRL_START                 *((volatile  uint8_t *)(0x42680008UL))
#define bFM0P_HDMICEC0_TXCTRL_START               *((volatile  uint8_t *)(0x42680008UL))
#define bFM_HDMICEC0_TXCTRL_EOM                   *((volatile  uint8_t *)(0x4268000CUL))
#define bFM0P_HDMICEC0_TXCTRL_EOM                 *((volatile  uint8_t *)(0x4268000CUL))
#define bFM_HDMICEC0_TXCTRL_ITSTEN                *((volatile  uint8_t *)(0x42680010UL))
#define bFM0P_HDMICEC0_TXCTRL_ITSTEN              *((volatile  uint8_t *)(0x42680010UL))
#define bFM_HDMICEC0_TXCTRL_IBREN                 *((volatile  uint8_t *)(0x42680014UL))
#define bFM0P_HDMICEC0_TXCTRL_IBREN               *((volatile  uint8_t *)(0x42680014UL))

#define bFM_HDMICEC0_TXSTS_ACKSV                  *((volatile  uint8_t *)(0x42680100UL))
#define bFM0P_HDMICEC0_TXSTS_ACKSV                *((volatile  uint8_t *)(0x42680100UL))
#define bFM_HDMICEC0_TXSTS_ITST                   *((volatile  uint8_t *)(0x42680110UL))
#define bFM0P_HDMICEC0_TXSTS_ITST                 *((volatile  uint8_t *)(0x42680110UL))
#define bFM_HDMICEC0_TXSTS_IBR                    *((volatile  uint8_t *)(0x42680114UL))
#define bFM0P_HDMICEC0_TXSTS_IBR                  *((volatile  uint8_t *)(0x42680114UL))


